Core/src/DataProcessors/СинхронизацияЭлектронныхСФ/СинхронизацияЭлектронныхСФ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СинхронизацияЭлектронныхСФ</name>
  <tabularSections>
    <name>СписокСФ</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>f_series</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>f_number</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Operation_DT</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Reg_DT</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Seller_UN_ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Buyer_UN_ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Status</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>K_ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>K_Type</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Tanxa</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Sa_Ident_No</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Org_Name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Was_Ref</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>EnumRef.СтатусыСФ</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СписокНакладных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.СчетФактураПолученныйГрузия</types>
        <types>DocumentRef.СчетФактураОтправленныйГрузия</types>
      </type>
    </attributes>
    <attributes>
      <name>Флаг</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьОшибки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактураАванса</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДляФильтра</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыНаПортале</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАкциза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>11</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыФактуры</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.СчетФактураПолученныйГрузия</types>
        <types>DocumentRef.СчетФактураОтправленныйГрузия</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Core/src/Enums/ВидыОперацийРасходнаяНакладная/ВидыОперацийРасходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийРасходнаяНакладная</name>
  <enumValues>
    <name>ПродажаПокупателю</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВПереработку</name>
  </enumValues>
  <enumValues>
    <name>ПередачаНаОтветхранение</name>
  </enumValues>
  <enumValues>
    <name>ВозвратПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВозвратКомитенту</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзПереработки</name>
  </enumValues>
  <enumValues>
    <name>ВозвратСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>БезвозмезднаяПродажаСотруднику</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ВидыОперацийПриходнаяНакладная/ВидыОперацийПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПриходнаяНакладная</name>
  <enumValues>
    <name>ПоступлениеОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ПриемНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ПриемВПереработку</name>
  </enumValues>
  <enumValues>
    <name>ПриемНаОтветхранение</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтКомиссионера</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПереработчика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаКапитальныхЗатрат</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/СчетФактураПолученныйГрузия/СчетФактураПолученныйГрузия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СчетФактураПолученныйГрузия</name>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.АвансовыйОтчет</basedOn>
  <basedOn>Document.ДополнительныеРасходы</basedOn>
  <basedOn>Document.ОтчетПереработчика</basedOn>
  <basedOn>Document.ОтчетКомиссионера</basedOn>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.РасходСоСчета</basedOn>
  <basedOn>Document.РасходИзКассы</basedOn>
  <registerRecords>AccumulationRegister.АвансыПолученныхФактур</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоНалогам</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерСчетФактуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСФ</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Аванс</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалога</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаКВозмещениюРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.ПриходнаяНакладная</types>
        <types>DocumentRef.ОтчетПереработчика</types>
        <types>DocumentRef.Взаимозачет</types>
        <types>DocumentRef.ДополнительныеРасходы</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТоварыНаПортале</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаАкциза</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыПлатежа</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РасходСоСчета</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.РасходИзКассы</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/DataProcessors/СинхронизацияЭлектронныхСФ/Forms/Форма/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекДата		= ТекущаяДата();
	ДатаНач		= НачалоМесяца(ТекДата);
	ДатаКон		= КонецМесяца(ТекДата);
	Полученный	= Истина;
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(),"ОсновнаяОрганизация");
		Если НЕ ЗначениеЗаполнено(Организация) Тогда
			Организация = ОбщегоНазначенияКлиентСервер.ПредопределенныйЭлемент("Справочник.Организации.ОсновнаяОрганизация");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	ОчиститьСообщения();
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	ВыгрузитьНаСервере();
	КоличествоОтобранныхСтрок = Объект.СписокСФ.Количество();
	Элементы.СписокСФ.ОтборСтрок = Неопределено;
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьНаСервере()
	
	КонтрагентИНН = "";
	Если ЗначениеЗаполнено(Контрагент) Тогда
		КонтрагентИНН = СокрЛП(Контрагент.ИНН);
	КонецЕсли;
	Отборы = Новый Структура("S_DT, E_DT, Организация, КонтрагентИНН", ДатаНач, КонецДня(ДатаКон), Организация, КонтрагентИНН);
	Объект.СписокСФ.Очистить();
	Объект.ТоварыНаПортале.Очистить();
	Объект.ДокументыФактуры.Очистить();	
	
	МассивФильтровСтатуса = Новый Массив;
	МассивФильтровСтатуса.Добавить(0);
	МассивФильтровСтатуса.Добавить(0);
	МассивФильтровСтатуса.Добавить(0);
	МассивФильтровСтатуса.Добавить(0);
	МассивФильтровСтатуса.Добавить(0);
	МассивФильтровСтатуса.Добавить(0);
	МассивФильтровСтатуса.Добавить(0);
	МассивФильтровСтатуса.Добавить(0);
	МассивФильтровСтатуса.Добавить(0);
	МассивФильтровСтатуса.Добавить(0);
	
	//Полученные
	Если Полученный Тогда
		СписокПринятыхФактур = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьСписокПринятыхФактур(, Отборы);
		Если НЕ ТипЗнч(СписокПринятыхФактур) = Тип("Массив") Тогда
			Возврат;
		КонецЕсли;
		Для Каждого СтрокаТЗ ИЗ СписокПринятыхФактур Цикл
			НоваяЗапись = Объект.СписокСФ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТЗ);
			//НоваяЗапись.Reg_DT		= ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СтрокаВДату(СтрокаТЗ.Reg_DT);
			//НоваяЗапись.OPeration_DT	= ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СтрокаВДату(СтрокаТЗ.OPeration_DT);
			НоваяЗапись.Статус      	= ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьСтатусСФ_ИзЧисла(НоваяЗапись.Status);
			НоваяЗапись.СтатусДляФильтра= ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьСтатусСФ_ДляФильтра(НоваяЗапись.Status, НоваяЗапись.Was_Ref);
			НоваяЗапись.Состояние       = "მიღებული";
			НоваяЗапись.ФактураАванса	= (Лев(НоваяЗапись.f_series, 2) = "ავ");
			
			ТоварыСФ = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьТабЧастьФактуры(, Организация, НоваяЗапись.ID);
			Если Не ТоварыСФ = Неопределено Тогда
				Для Каждого СтрокаТЧRS Из ТоварыСФ Цикл
					СтрокаТовары = Объект.ТоварыНаПортале.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТовары, СтрокаТЧRS);
					СтрокаТовары.ID = НоваяЗапись.ID;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ЗаполнитьСписокФактур("მიღებული", Объект.СписокСФ);
		ПревязатьНакладныеКФактурам_Полученные();
	КонецЕсли;
	
	//Отправленные
	Если Отправленный Тогда
		СписокОтправленныхФактур = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьСписокОтправленныхФактур(, Отборы);
		Если НЕ ТипЗнч(СписокОтправленныхФактур) = Тип("Массив") Тогда
			Возврат;
		КонецЕсли;
		Для Каждого СтрокаТЗ ИЗ СписокОтправленныхФактур Цикл
			НоваяЗапись = Объект.СписокСФ.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТЗ);
			//НоваяЗапись.Reg_DT		= ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СтрокаВДату(СтрокаТЗ.Reg_DT);
			//НоваяЗапись.OPeration_DT	= ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СтрокаВДату(СтрокаТЗ.OPeration_DT);
			НоваяЗапись.Статус      	= ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьСтатусСФ_ИзЧисла(НоваяЗапись.Status);
			НоваяЗапись.СтатусДляФильтра= ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьСтатусСФ_ДляФильтра(НоваяЗапись.Status, НоваяЗапись.Was_Ref);
			НоваяЗапись.Состояние       = "გაცემული";
			НоваяЗапись.ФактураАванса	= (Лев(НоваяЗапись.f_series, 2) = "ავ");
			
			ТоварыСФ = ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ПолучитьТабЧастьФактуры(, Организация, НоваяЗапись.ID);
			Если Не ТоварыСФ = Неопределено Тогда
				Для Каждого СтрокаТЧRS Из ТоварыСФ Цикл
					СтрокаТовары = Объект.ТоварыНаПортале.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТовары, СтрокаТЧRS);
					СтрокаТовары.ID = НоваяЗапись.ID;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ЗаполнитьСписокФактур("გაცემული", Объект.СписокСФ);
		ПревязатьНакладныеКФактурам_Отправленные();
	КонецЕсли;
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ЗаполнитьСписок_КонтрагентовФактуры(Объект.СписокСФ);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокСФПриАктивизацииСтроки(Элемент)
	
	впТекущаяСтрока = Элементы.СписокСФ.ТекущиеДанные;
	Если впТекущаяСтрока <> Неопределено Тогда
		Элементы.ТоварыНаПортале.ОтборСтрок = Новый ФиксированнаяСтруктура("ID", впТекущаяСтрока.ID);
	Иначе 
		Элементы.ТоварыНаПортале.ОтборСтрок = Новый ФиксированнаяСтруктура("ID", "?????");
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьСФ(Команда)
	ОчиститьСообщения();
	ЕстьОшибки = Ложь;
	Создать_Документы(ЕстьОшибки);
	Если НЕ ЕстьОшибки Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.ДокументыФактуры;		
	КонецЕсли;
КонецПроцедуры

Процедура Создать_Документы(ЕстьОшибки)
	ПроверитьПередСозданиемДокументов(ЕстьОшибки);
	
	Созать_Полученныйе(ЕстьОшибки);
	Созать_Отправленные(ЕстьОшибки);	
КонецПроцедуры

&НаСервере
Процедура Созать_Полученныйе(ЕстьОшибки)
	
	СписокВыбранныхСФ = Объект.СписокСФ.НайтиСтроки(Новый Структура("Флаг, Состояние, ЕстьОшибки", Истина, "მიღებული", Ложь));
	Для Каждого Запись ИЗ СписокВыбранныхСФ Цикл 
		ДокументОбъект	= Документы.СчетФактураПолученныйГрузия.СоздатьДокумент();
		ДокументОбъект.Дата						= ТекущаяДата();
		ДокументОбъект.Автор					= ПараметрыСеанса.ТекущийПользователь.Ссылка;
		ДокументОбъект.Идентификатор			= Запись.ID;
		ДокументОбъект.ПериодРегистрации		= Запись.Reg_DT;
		ДокументОбъект.ДатаВходящегоДокумента	= Запись.Operation_DT;
		ДокументОбъект.Серия					= Запись.f_series;
		ДокументОбъект.НомерСчетФактуры			= Запись.f_number;
		ДокументОбъект.НомерВходящегоДокумента	= ДокументОбъект.Серия + " " + ДокументОбъект.НомерСчетФактуры;
		ДокументОбъект.Идентификатор			= Запись.ID;
		ДокументОбъект.Организация				= Организация;
		ДокументОбъект.Контрагент				= Запись.Контрагент;
		ДокументОбъект.Статус					= Запись.Статус;
		ДокументОбъект.Аванс					= Запись.ФактураАванса;
		
		Если НЕ Запись.ФактураАванса Тогда
			//Документы
			Если ЗначениеЗаполнено(Запись.ПривязанныеТТН) Тогда
				ТаблицаНакладных = НайтиТТН_Полученной(Запись.ПривязанныеТТН);
				Для Каждого СтрокаТЗ ИЗ ТаблицаНакладных Цикл
					СтрокаДО = ДокументОбъект.ДокументыОснования.Добавить();
					СтрокаДО.ДокументОснование = СтрокаТЗ.ДокументОснование;
					СтруктураСумм = ПолучитьСуммуИНДСУДокумента(СтрокаДО.ДокументОснование);
					ЗаполнитьЗначенияСвойств(СтрокаДО, СтруктураСумм);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
		
		//Товары
		ТоварыНаПортале = Объект.ТоварыНаПортале.НайтиСтроки(Новый Структура("ID", Запись.ID));
		Для Каждого СтрокаТЗ Из ТоварыНаПортале Цикл
			СтрокаТ = ДокументОбъект.ТоварыНаПортале.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТ, СтрокаТЗ);
		КонецЦикла;
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			СтрокаДокФактуры = Объект.ДокументыФактуры.Добавить();
			СтрокаДокФактуры.Документ	= ДокументОбъект.Ссылка;
			Запись.Документ	= ДокументОбъект.Ссылка;
			Запись.Флаг		= Ложь;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		
		//ДокументСсылка = ДокументОбъект.Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры
&НаСервере
Процедура Созать_Отправленные(ЕстьОшибки)
	
	СписокВыбранныхСФ = Объект.СписокСФ.НайтиСтроки(Новый Структура("Флаг, Состояние, ЕстьОшибки", Истина, "გაცემული", Ложь));
	Для Каждого Запись ИЗ СписокВыбранныхСФ Цикл 
		ДокументОбъект	= Документы.СчетФактураОтправленныйГрузия.СоздатьДокумент();
		ДокументОбъект.Дата						= ТекущаяДата();
		ДокументОбъект.Автор					= ПараметрыСеанса.ТекущийПользователь.Ссылка;
		ДокументОбъект.Идентификатор			= Запись.ID;
		ДокументОбъект.ПериодРегистрации		= Запись.Reg_DT;
		ДокументОбъект.ДатаВходящегоДокумента	= Запись.Operation_DT;
		ДокументОбъект.Серия					= Запись.f_series;
		ДокументОбъект.НомерСчетФактуры			= Запись.f_number;
		ДокументОбъект.НомерВходящегоДокумента	= ДокументОбъект.Серия + " " + ДокументОбъект.НомерСчетФактуры;
		ДокументОбъект.Идентификатор			= Запись.ID;
		ДокументОбъект.Организация				= Организация;
		ДокументОбъект.Контрагент				= Запись.Контрагент;
		ДокументОбъект.Статус					= Запись.Статус;
		ДокументОбъект.Аванс					= Запись.ФактураАванса;
		
		Если НЕ Запись.ФактураАванса Тогда
			//Документы
			ТаблицаНакладных = Неопределено;
			Если ЗначениеЗаполнено(Запись.ПривязанныеТТН) Тогда
				ТаблицаНакладных = НайтиТТН_Отправленные(Запись.ПривязанныеТТН);
				Для Каждого СтрокаТЗ ИЗ ТаблицаНакладных Цикл
					СтрокаДО = ДокументОбъект.ДокументыОснования.Добавить();
					СтрокаДО.ДокументОснование = СтрокаТЗ.ДокументОснование;
					СтруктураСумм = ПолучитьСуммуИНДСУДокумента(СтрокаДО.ДокументОснование);
					ЗаполнитьЗначенияСвойств(СтрокаДО, СтруктураСумм);
				КонецЦикла;
			КонецЕсли;
			
			//Запасы
			Если НЕ ТаблицаНакладных = Неопределено Тогда
				ДокументОбъект.ЗаполнитьЗапасы(ТаблицаНакладных.ВыгрузитьКолонку("ДокументОснование"));
			КонецЕсли;
		КонецЕсли;
		
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			СтрокаДокФактуры = Объект.ДокументыФактуры.Добавить();
			СтрокаДокФактуры.Документ	= ДокументОбъект.Ссылка;
			Запись.Документ	= ДокументОбъект.Ссылка;
			Запись.Флаг		= Ложь;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		
		//ДокументСсылка = ДокументОбъект.Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПревязатьНакладныеКФактурам_Полученные()
	
	УстановитьПривилегированныйРежим(Истина);
	Для Каждого СтрокаСФ ИЗ Объект.СписокСФ Цикл
		Если ЗначениеЗаполнено(СтрокаСФ.Документ) Тогда
            ПерваяСтрока		  = Истина;
			ЕстьИзминении		  = Ложь;
			ЕстьИзминенииВСтатусе = Ложь;
			Если НЕ СтрокаСФ.Статус = СтрокаСФ.Документ.Статус Тогда
				ЕстьИзминенииВСтатусе = Истина;
			КонецЕсли;
			ТаблицаНакладных = НайтиТТН_Полученной(СтрокаСФ.ПривязанныеТТН);
			Для Каждого СтрокаПН ИЗ ТаблицаНакладных Цикл
				НайденныеСтроки = СтрокаСФ.Документ.ДокументыОснования.НайтиСтроки(Новый Структура("ДокументОснование", СтрокаПН.ДокументОснование));
				Если НайденныеСтроки.Количество() = 0 Тогда
					Если ПерваяСтрока Тогда
						ДокументСф = СтрокаСФ.Документ.ПолучитьОбъект();
						ПерваяСтрока	= Ложь;
						ЕстьИзминении	= Истина;
					КонецЕсли;
					СтрокаДО = ДокументСф.ДокументыОснования.Добавить();
					СтрокаДО.ДокументОснование = СтрокаПН.ДокументОснование;
					СтруктураСумм = ПолучитьСуммуИНДСУДокумента(СтрокаДО.ДокументОснование);
					ЗаполнитьЗначенияСвойств(СтрокаДО, СтруктураСумм);
				КонецЕсли;
			КонецЦикла;
			Если ЕстьИзминении Тогда
				ДокументСф.ТоварыНаПортале.Очистить();
				ТоварыНаПортале = Объект.ТоварыНаПортале.НайтиСтроки(Новый Структура("ID", СтрокаСФ.ID));
				Для Каждого СтрокаТЗ Из ТоварыНаПортале Цикл
					СтрокаТ = ДокументСф.ТоварыНаПортале.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТ, СтрокаТЗ);
				КонецЦикла;
				Если ЕстьИзминенииВСтатусе Тогда
					ДокументСф.Статус = СтрокаСФ.Статус;
				КонецЕсли;
				ДокументСф.Записать();
			ИначеЕсли ЕстьИзминенииВСтатусе Тогда
				ДокументСф = СтрокаСФ.Документ.ПолучитьОбъект();
				ДокументСф.Статус = СтрокаСФ.Статус;
				ДокументСф.Записать();
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры
&НаСервере
Процедура ПревязатьНакладныеКФактурам_Отправленные()
	
	УстановитьПривилегированныйРежим(Истина);
	Для Каждого СтрокаСФ ИЗ Объект.СписокСФ Цикл
		Если ЗначениеЗаполнено(СтрокаСФ.Документ) Тогда
            ПерваяСтрока		  = Истина;
			ЕстьИзминении		  = Ложь;
			ЕстьИзминенииВСтатусе = Ложь;
			Если НЕ СтрокаСФ.Статус = СтрокаСФ.Документ.Статус Тогда
				ЕстьИзминенииВСтатусе = Истина;
			КонецЕсли;
			ТаблицаНакладных = НайтиТТН_Полученной(СтрокаСФ.ПривязанныеТТН);
			Для Каждого СтрокаПН ИЗ ТаблицаНакладных Цикл
				НайденныеСтроки = СтрокаСФ.Документ.ДокументыОснования.НайтиСтроки(Новый Структура("ДокументОснование", СтрокаПН.ДокументОснование));
				Если НайденныеСтроки.Количество() = 0 Тогда
					Если ПерваяСтрока Тогда
						ДокументСф = СтрокаСФ.Документ.ПолучитьОбъект();
						ПерваяСтрока	= Ложь;
						ЕстьИзминении	= Истина;
					КонецЕсли;
					СтрокаДО = ДокументСф.ДокументыОснования.Добавить();
					СтрокаДО.ДокументОснование = СтрокаПН.ДокументОснование;
					СтруктураСумм = ПолучитьСуммуИНДСУДокумента(СтрокаДО.ДокументОснование);
					ЗаполнитьЗначенияСвойств(СтрокаДО, СтруктураСумм);
				КонецЕсли;
			КонецЦикла;
			Если ЕстьИзминении Тогда
				ДокументСф.ТоварыНаПортале.Очистить();
				ТоварыНаПортале = Объект.ТоварыНаПортале.НайтиСтроки(Новый Структура("ID", СтрокаСФ.ID));
				Для Каждого СтрокаТЗ Из ТоварыНаПортале Цикл
					СтрокаТ = ДокументСф.ТоварыНаПортале.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаТ, СтрокаТЗ);
				КонецЦикла;
				Если ЕстьИзминенииВСтатусе Тогда
					ДокументСф.Статус = СтрокаСФ.Статус;
				КонецЕсли;
				ДокументСф.ОбменДанными.Загрузка = Истина;
				ДокументСф.Записать();
			ИначеЕсли ЕстьИзминенииВСтатусе Тогда
				ДокументСф = СтрокаСФ.Документ.ПолучитьОбъект();
				ДокументСф.Статус = СтрокаСФ.Статус;
				ДокументСф.ОбменДанными.Загрузка = Истина;
				ДокументСф.Записать();
			КонецЕсли;			
		КонецЕсли;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры



&НаСервереБезКонтекста
Функция НайтиТТН_Полученной(НомераНакладных)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяНакладная.Ссылка КАК ДокументОснование,
		|	ПриходнаяНакладная.НомерТТН
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|ГДЕ
		|	НЕ ПриходнаяНакладная.НомерТТН = """"
		|	И ПриходнаяНакладная.НомерТТН В(&НомераНакладных)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка,
		|	РасходнаяНакладная.НомерТТН
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	НЕ РасходнаяНакладная.НомерТТН = """"
		|	И РасходнаяНакладная.НомерТТН В(&НомераНакладных)
		|	И РасходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику)";
	Запрос.УстановитьПараметр("НомераНакладных", НомераНакладных);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
&НаСервереБезКонтекста
Функция НайтиТТН_Отправленные(НомераНакладных)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладная.Ссылка КАК ДокументОснование,
		|	РасходнаяНакладная.НомерТТН
		|ИЗ
		|	Документ.РасходнаяНакладная КАК РасходнаяНакладная
		|ГДЕ
		|	НЕ РасходнаяНакладная.НомерТТН = """"
		|	И РасходнаяНакладная.НомерТТН В(&НомераНакладных)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПриходнаяНакладная.Ссылка,
		|	ПриходнаяНакладная.НомерТТН
		|ИЗ
		|	Документ.ПриходнаяНакладная КАК ПриходнаяНакладная
		|ГДЕ
		|	НЕ ПриходнаяНакладная.НомерТТН = """"
		|	И ПриходнаяНакладная.НомерТТН В(&НомераНакладных)
		|	И ПриходнаяНакладная.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя)";
	Запрос.УстановитьПараметр("НомераНакладных", НомераНакладных);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьСуммуИНДСУДокумента(ДокументСсылка)

	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ДополнительныеРасходы") Тогда
		СуммаНДСДокумент = ДокументСсылка.Расходы.Итог("СуммаНДС");
	Иначе
		СуммаНДСДокумент = ДокументСсылка.Запасы.Итог("СуммаНДС") + ?(ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриходнаяНакладная"), ДокументСсылка.Расходы.Итог("СуммаНДС"), 0);
	КонецЕсли;
	СуммаВсего 			= ДокументСсылка.СуммаДокумента;
	СуммаДокумент		= СуммаВсего - СуммаНДСДокумент;
	
	Возврат Новый Структура("СуммаДокумента, СуммаНДС, Всего", СуммаДокумент, СуммаНДСДокумент, СуммаВсего);
	
КонецФункции




&НаСервере
Процедура ПроверитьПередСозданиемДокументов(ЕстьОшибки)
	
	ОтмеченныеСтроки = Объект.СписокСФ.НайтиСтроки(Новый Структура("Флаг", Истина));
	Для Каждого СтрокаСФ Из ОтмеченныеСтроки Цикл
		Если Не ЗначениеЗаполнено(СтрокаСФ.Контрагент) Тогда 
			Сообщение = Новый СообщениеПользователю;
			пНомерСтроки = Формат(СтрокаСФ.НомерСтроки-1, "ЧГ=0");
			Сообщение.Текст = "სტრიქონში ნომერი " + Формат(СтрокаСФ.НомерСтроки, "ЧГ=0") + " ფაქტურისთვი " +Формат(СтрокаСФ.ID, "ЧГ=0")+ " არ არის შევსებული კონტრაგენტი";
			Сообщение.Поле =  "Объект.СписокСФ[" + пНомерСтроки + "].Контрагент";
			Сообщение.УстановитьДанные(Объект);
			Сообщение.Сообщить();
			СтрокаСФ.ЕстьОшибки = Истина;
			ЕстьОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры



&НаКлиенте
Процедура СнятьФлажки(Команда)
	УстановитьСнятьФлажки(Ложь);
КонецПроцедуры
&НаКлиенте
Процедура УстановитьФлажки(Команда)
	УстановитьСнятьФлажки(Истина);
КонецПроцедуры
&НаСервере
Процедура УстановитьСнятьФлажки(знч_Загружать)
	Если знч_Загружать Тогда
		Для Каждого Стр Из Объект.СписокСФ Цикл
			Если НЕ ЗначениеЗаполнено(Стр.Документ) Тогда
				Стр.Флаг = знч_Загружать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого Стр Из Объект.СписокСФ Цикл 
			Стр.Флаг = знч_Загружать;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры




&НаКлиенте
Процедура Все(Команда)
	Элементы.СписокСФ.ОтборСтрок = Неопределено;
	СписокСФПриАктивизацииСтроки(Неопределено);
	КоличествоОтобранныхСтрок = Объект.СписокСФ.Количество();
КонецПроцедуры
&НаКлиенте
Процедура КОтправке(Команда)
	УстановитьОтборСтрок(0);
КонецПроцедуры
&НаКлиенте
Процедура Отклонен(Команда)
	УстановитьОтборСтрок(10);
КонецПроцедуры
&НаКлиенте
Процедура Отправленная(Команда)
	УстановитьОтборСтрок(1);
КонецПроцедуры
&НаКлиенте
Процедура Подтвержденная(Команда)
	УстановитьОтборСтрок(2);
КонецПроцедуры
&НаКлиенте
Процедура Отмененная(Команда)
	УстановитьОтборСтрок(67);
КонецПроцедуры
&НаКлиенте
Процедура Первичная(Команда)
	УстановитьОтборСтрок(3);
КонецПроцедуры
&НаКлиенте
Процедура Коректированный(Команда)
	УстановитьОтборСтрок(458);
КонецПроцедуры
&НаКлиенте
Процедура Замененная(Команда)
	УстановитьОтборСтрок(9);
КонецПроцедуры
&НаКлиенте
Процедура Удаленный(Команда)
	УстановитьОтборСтрок(-1);
КонецПроцедуры


&НаКлиенте
Процедура УстановитьОтборСтрок(ОтборПоСтрокеОтбора)
	
	Элементы.СписокСФ.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("СтатусДляФильтра", ОтборПоСтрокеОтбора));
	СписокСФПриАктивизацииСтроки(Неопределено);
	КоличествоОтобранныхСтрок = Объект.СписокСФ.НайтиСтроки(Новый Структура("СтатусДляФильтра", ОтборПоСтрокеОтбора)).Количество();
	
КонецПроцедуры
